VNCS_MESSAGES = {
    "vncs_learn_1": {
        "text": "ВНЧС (височно-нижнечелюстной сустав) — это парный сустав, соединяющий нижнюю челюсть с височной костью черепа.\n\nКогда его функция нарушается, мышцы лица, шеи и даже спины перенапрягаются, пытаясь компенсировать дисбаланс. Это может приводить к характерным симптомам: щелчкам в суставе, болевым ощущениям и асимметрии лица.",
        "video": "BAACAgIAAxkBAANNaWnJMHO2A_L-m-lJ86FNBuT3hrkAAs2BAAL0ZuFL0t-WvwW_unU4BA",
        "buttons": [
            ("🔘 Главное меню", "start_main"),
            ("🔘 Хочу узнать больше", "vncs_learn_2"),
            ("🔘 Записаться на консультацию", "consultation")
        ]
    },
    "vncs_learn_2": {
        "text": "Щелчок возникает в момент, когда суставной диск — соскальзывает со своего физиологичного положения и затем резко возвращается на место. Это характерный признак *дисфункции ВНЧС*.\n\n*На первых этапах* это может происходить без боли, но щелчок уже сигнализирует о *нарушении биомеханики* сустава. Это начальная фаза проблемы, когда структуры начинают «изнашиваться».\n\n*Если не восстановить правильную работу сустава*, процесс усугубляется. Со временем может развиться *ограничение открывания рта*, а хроническое напряжение мышц, компенсирующих дисфункцию, часто приводит к *стойким головным и лицевым болям*, а также болям в шее.",
        "video": "BAACAgIAAxkBAANPaWnJOL6mhPfq0U6AAv-Pqq6K_egAAsqBAAL0ZuFLUDZAe70wg184BA",
        "buttons": [
            ("🔘 Главное меню", "start_main"),
            ("🔘 Интересно, идём дальше", "vncs_learn_3"),
            ("🔘 Записаться на консультацию", "consultation")
        ]
    },
    "vncs_learn_3": {
        "text": "Стресс (непроизвольное сжимание зубов, особенно во сне), неправильный прикус, патологическая стираемость зубов и прорезывание зубов мудрости — всё это создаёт *хроническую перегрузку* височно-нижнечелюстного сустава.\n\n*Крайне важно точно диагностировать и устранить причину на ранней стадии*, пока нарушения не привели к стойкому смещению суставных структур и необратимым изменениям.",
        "video": "BAACAgIAAxkBAANRaWnJVNlKaFOwltQIfzHcTI6OIygAAs6BAAL0ZuFL88bn8jIm60U4BA",
        "buttons": [
            ("🔘 Главное меню", "start_main"),
            ("🔘 Хочу проверить сустав и пройти тест", "test_vncs_q1"),
            ("🔘 Записаться на консультацию", "consultation")
        ]
    }
}
